"use strict";

var _ = require('underscore');

var contains = function (haystack, needle) {
  return haystack.indexOf(needle) >= 0;
};

var translateDictionary = {
  // Yaku
  '立直': '리치',
  '七対子': '치또이츠',
  '流し満貫': '유국만관',
  '門前清自摸和': '쯔모',
  '一発': '일발',
  '海底撈月': '해저로월',
  '河底撈魚': '하저로어',
  '嶺上開花': '영상개화',
  '搶槓': '챵깡',
  '槍槓': '챵깡',
  'ダブル': '더블',
  'ダブルリーチ': '더블리치',
  '平和': '핑후',
  '一盃口': '이페코',
  '三色同順': '삼색동순',
  '一気通貫': '일기통관',
  '二盃口': '량페코',
  '対々和': '또이또이',
  '三暗刻': '상앙코',
  '三色同刻': '삼색동각',
  '三槓子': '산캉츠',
  '断么九': '탕야오',
  '断幺九': '탕야오',
  '役牌': '역패',
  '場風': '판풍역패',
  '自風': '자풍역패',
  '全帯么': '챤타',
  '純全帯么': '쥰챤타',
  '混老頭': '혼노두',
  '小三元': '소삼원',
  '混一色': '혼일색',
  '清一色': '청일색',
  '国士無双': '국사무쌍',
  '四暗刻': '쓰앙코',
  '大三元': '대삼원',
  '小四喜': '소사희',
  '大四喜': '대사희',
  '字一色': '자일색',
  '清老頭': '청노두',
  '大七星': '대칠성',
  '緑一色': '녹일색',
  '九蓮宝燈': '구련보등',
  '四槓子': '스캉츠',
  '天和': '천화',
  '地和': '지화',
  '人和': '인화',
  '裏ドラ': '우라도라',
  '赤ドラ': '아카도라',
  'ドラ': '도라',

  // Pan
  '満貫': '만관',
  '跳満': '하네만',
  '倍満': '배만',
  '三倍満': '삼배만',
  '役満': '역만',

  // Etc
  '点': '점',
  '∀': '올',
  '符': '부',
  '飜': '판'
};

module.exports = function (query) {
  _.each(translateDictionary, function (value, key) {
    if (contains(query, key)) {
      query = query.replace(key, value);
    }
  });
  return query;
};
